<a href="https://colab.research.google.com/github/quantummouse/dm_pandas/blob/master/Assignment2_Data612_AK.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:


import pandas as pd

In [6]:
scientists = pd.read_csv('https://raw.githubusercontent.com/chendaniely/\
pandas_for_everyone/master/data/scientists.csv')

scientists

                   Name        Born        Died  Age          Occupation
0     Rosaline Franklin  1920-07-25  1958-04-16   37             Chemist
1        William Gosset  1876-06-13  1937-10-16   61        Statistician
2  Florence Nightingale  1820-05-12  1910-08-13   90               Nurse
3           Marie Curie  1867-11-07  1934-07-04   66             Chemist
4         Rachel Carson  1907-05-27  1964-04-14   56           Biologist
5             John Snow  1813-03-15  1858-06-16   45           Physician
6           Alan Turing  1912-06-23  1954-06-07   41  Computer Scientist
7          Johann Gauss  1777-04-30  1855-02-23   77       Mathematician

Assignment 
 Create a new column using the date column.

    Find the maximum date of your data.
    Subtract all the dates on the column from the maximum date.
    Convert the number of days into number of months.
    Save the result on a new column and add to the data set.
    Save the dataset as a csv file.
    Upload the assignment on your GitHub account and Update the README file where you explain everything you did.

In [7]:
birthday = scientists.Born
birthday

0    1920-07-25
1    1876-06-13
2    1820-05-12
3    1867-11-07
4    1907-05-27
5    1813-03-15
6    1912-06-23
7    1777-04-30
Name: Born, dtype: object

In [8]:
birthdayDate = pd.to_datetime(birthday, format = '%Y-%m-%d')
birthdayDate

0   1920-07-25
1   1876-06-13
2   1820-05-12
3   1867-11-07
4   1907-05-27
5   1813-03-15
6   1912-06-23
7   1777-04-30
Name: Born, dtype: datetime64[ns]

In [10]:
maxDate = max(birthdayDate)
maxDate

Timestamp('1920-07-25 00:00:00')

In [12]:
difference = maxDate - birthdayDate
difference

0       0 days
1   16112 days
2   36598 days
3   19253 days
4    4808 days
5   39213 days
6    2954 days
7   52315 days
Name: Born, dtype: timedelta64[ns]

In [13]:
import numpy as np
import datetime

In [15]:
diffMonths = difference / np.timedelta64(1, 'M')
diffMonths

0       0.000000
1     529.357892
2    1202.423048
3     632.555083
4     157.966283
5    1288.338570
6      97.053328
7    1718.803261
Name: Born, dtype: float64

In [17]:
scientists['diffInDate'] = diffMonths
scientists

                   Name        Born  ...          Occupation   diffInDate
0     Rosaline Franklin  1920-07-25  ...             Chemist     0.000000
1        William Gosset  1876-06-13  ...        Statistician   529.357892
2  Florence Nightingale  1820-05-12  ...               Nurse  1202.423048
3           Marie Curie  1867-11-07  ...             Chemist   632.555083
4         Rachel Carson  1907-05-27  ...           Biologist   157.966283
5             John Snow  1813-03-15  ...           Physician  1288.338570
6           Alan Turing  1912-06-23  ...  Computer Scientist    97.053328
7          Johann Gauss  1777-04-30  ...       Mathematician  1718.803261

[8 rows x 6 columns]

In [19]:
scientists.to_csv('scientists_clean.csv', index=False)